# ELT Process

### Libraries

In [8]:
import pandas as pd
from pathlib import Path
import sqlalchemy as sql

## Portugal Data

DataSource: https://tradingeconomics.com/portugal/tourist-arrivals

In [9]:
# Upload data from the CSV
portugal_df = pd.read_csv(Path('Data/portugal_data.csv'))
portugal_df.head()

,Country,Category,DateTime,Value,Frequency,HistoricalDataSymbol,LastUpdate
0,Portugal,Tourist Arrivals,1964-01-31T00:00:00,90000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00
1,Portugal,Tourist Arrivals,1964-02-29T00:00:00,105000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00
2,Portugal,Tourist Arrivals,1964-03-31T00:00:00,154000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00
3,Portugal,Tourist Arrivals,1964-04-30T00:00:00,166000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00
4,Portugal,Tourist Arrivals,1964-05-31T00:00:00,295000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00

In [10]:
# Verify Variables
portugal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country               700 non-null    object
 1   Category              700 non-null    object
 2   DateTime              700 non-null    object
 3   Value                 700 non-null    int64
 4   Frequency             700 non-null    object
 5   HistoricalDataSymbol  700 non-null    object
 6   LastUpdate            700 non-null    object
dtypes: int64(1), object(6)
memory usage: 38.4+ KB

In [11]:
#Transform Object to Date
portugal_df['Date'] = pd.to_datetime(portugal_df['DateTime'])
portugal_df.head()

,Country,Category,DateTime,Value,Frequency,HistoricalDataSymbol,LastUpdate,Date
0,Portugal,Tourist Arrivals,1964-01-31T00:00:00,90000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00,1964-01-31
1,Portugal,Tourist Arrivals,1964-02-29T00:00:00,105000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00,1964-02-29
2,Portugal,Tourist Arrivals,1964-03-31T00:00:00,154000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00,1964-03-31
3,Portugal,Tourist Arrivals,1964-04-30T00:00:00,166000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00,1964-04-30
4,Portugal,Tourist Arrivals,1964-05-31T00:00:00,295000,Monthly,PORTUGALTOUARR,2015-08-21T14:52:00,1964-05-31

In [12]:
#Drop columns to keep main information
portugal_df = portugal_df.drop(['Category','DateTime','Frequency','HistoricalDataSymbol','LastUpdate'],axis = 1)
portugal_df.head()

    Country   Value       Date
0  Portugal   90000 1964-01-31
1  Portugal  105000 1964-02-29
2  Portugal  154000 1964-03-31
3  Portugal  166000 1964-04-30
4  Portugal  295000 1964-05-31

In [13]:
#Final Dataframe based on data after 2002
portugal_df = portugal_df[portugal_df['Date']>= '2000-01-01']

In [14]:
portugal_df.reset_index(drop=True,inplace = True)
portugal_df = portugal_df.rename(columns = {'Value':'y',
                                           'Date':'ds'})
portugal_df.head()

    Country        y         ds
0  Portugal  1075000 2000-01-31
1  Portugal  1393000 2000-02-29
2  Portugal  1948000 2000-03-31
3  Portugal  2276000 2000-04-30
4  Portugal  2583000 2000-05-31

In [15]:
portugal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 268 entries, 0 to 267
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  268 non-null    object
 1   y        268 non-null    int64
 2   ds       268 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 6.4+ KB

## Singapore

Data Source:

In [16]:
singapore_df = pd.read_csv(Path("Data/singapore_datav2.csv"))
singapore_df.head()

  Arrival Month Year  Visitor Arrivals
0           1-1-2008            885290
1           2-1-2008            813028
2           3-1-2008            910635
3           4-1-2008            829438
4           5-1-2008            833604

In [17]:
singapore_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Arrival Month Year  173 non-null    object
 1   Visitor Arrivals    173 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.8+ KB

In [18]:
singapore_df['ds'] = pd.to_datetime(singapore_df['Arrival Month Year'])
singapore_df = singapore_df.rename(columns={'Visitor Arrivals':'y'})
singapore_df = singapore_df.drop(['Arrival Month Year'],axis=1)
singapore_df.head()

        y         ds
0  885290 2008-01-01
1  813028 2008-02-01
2  910635 2008-03-01
3  829438 2008-04-01
4  833604 2008-05-01

In [19]:
singapore_df['Country'] = 'Singapore'
singapore_df.head()

        y         ds    Country
0  885290 2008-01-01  Singapore
1  813028 2008-02-01  Singapore
2  910635 2008-03-01  Singapore
3  829438 2008-04-01  Singapore
4  833604 2008-05-01  Singapore

## UK Data

DataSource:

In [20]:
uk_df = pd.read_csv(Path('Data/UK data.csv'))
uk_df.head(25)

    Unnamed: 0 Unnamed: 1      NSA  Unnamed: 3
0       2012.0        Jan   2,246          NaN
1          NaN        Feb   1,736          NaN
2          NaN        Mar   2,267          NaN
3          NaN        Apr   2,917          NaN
4          NaN        May   2,970          NaN
5          NaN        Jun   2,570          NaN
6          NaN        Jul   3,158          NaN
7          NaN        Aug   3,016          NaN
8          NaN        Sep   2,612          NaN
9          NaN        Oct   2,690          NaN
10         NaN        Nov   2,476          NaN
11         NaN        Dec   2,427          NaN
12      2013.0        Jan   2,200          NaN
13         NaN        Feb   1,951          NaN
14         NaN        Mar   2,181          NaN
15         NaN        Apr   2,888          NaN
16         NaN        May   3,084          NaN
17         NaN       June   2,897          NaN
18         NaN       July   3,304          NaN
19         NaN        Aug   3,535          NaN
20         NaN        Sep   2,806          NaN
21         NaN        Oct   2,980          NaN
22         NaN        Nov   2,443          NaN
23         NaN        Dec   2,420          NaN
24      2014.0        Jan   2,359          NaN

In [21]:
uk_df.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'NSA', 'Unnamed: 3'], dtype='object')

In [22]:
uk_df = uk_df.rename(columns = {'Unnamed: 0':'year',
                       'Unnamed: 1':'month'})

uk_df[uk_df['year'].isna()]['year'] = None
uk_df.head()

C:\Users\tiago\anaconda3\envs\FinTech\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

     year month      NSA  Unnamed: 3
0  2012.0   Jan   2,246          NaN
1     NaN   Feb   1,736          NaN
2     NaN   Mar   2,267          NaN
3     NaN   Apr   2,917          NaN
4     NaN   May   2,970          NaN

In [23]:
uk_df = uk_df.fillna(method = 'ffill')
uk_df.head(20)

      year month      NSA  Unnamed: 3
0   2012.0   Jan   2,246          NaN
1   2012.0   Feb   1,736          NaN
2   2012.0   Mar   2,267          NaN
3   2012.0   Apr   2,917          NaN
4   2012.0   May   2,970          NaN
5   2012.0   Jun   2,570          NaN
6   2012.0   Jul   3,158          NaN
7   2012.0   Aug   3,016          NaN
8   2012.0   Sep   2,612          NaN
9   2012.0   Oct   2,690          NaN
10  2012.0   Nov   2,476          NaN
11  2012.0   Dec   2,427          NaN
12  2013.0   Jan   2,200          NaN
13  2013.0   Feb   1,951          NaN
14  2013.0   Mar   2,181          NaN
15  2013.0   Apr   2,888          NaN
16  2013.0   May   3,084          NaN
17  2013.0  June   2,897          NaN
18  2013.0  July   3,304          NaN
19  2013.0   Aug   3,535          NaN

In [24]:
uk_df = uk_df.drop(['Unnamed: 3'],axis = 1)

In [25]:
uk_df['day']= 1
uk_df['year']=uk_df['year'].astype(int)

In [26]:
uk_df.month.unique()

array(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep',
       'Oct', 'Nov', 'Dec', 'June', 'July', 'Sept'], dtype=object)

In [27]:
labels_month = {'Jan':1,
               'Feb':2,
               'Mar':3,
               'Apr':4,
               'May':5,
                'Jun':6,
               'June':6,
               'Jul':7,
                'July':7,
               'Aug':8,
               'Sep':9,
                'Sept':9,
               'Oct':10,
               'Nov':11,
               'Dec':12}

In [28]:
uk_df['month_num'] = uk_df['month'].apply(lambda x: labels_month[x])

In [29]:
cols = ['year','month_num','day']

In [30]:
uk_df['ds'] = uk_df[cols].apply(lambda x: '-'.join(x.values.astype(str)),axis = 'columns')
uk_df['ds'] = pd.to_datetime(uk_df['ds'])

In [31]:
uk_df['y'] = uk_df['NSA'].str.replace(',','').astype(int)*1000
uk_df = uk_df[['ds','y']]

In [32]:
uk_df['Country'] = 'UK'
uk_df.head()

          ds        y Country
0 2012-01-01  2246000      UK
1 2012-02-01  1736000      UK
2 2012-03-01  2267000      UK
3 2012-04-01  2917000      UK
4 2012-05-01  2970000      UK

## Jamaica Data

DataSource:

In [33]:
jamaica_df = pd.read_csv(Path('Data/Jamaica Monthly Tourist Visitors v2.csv'))
jamaica_df.head()

         ds        y
0  1/1/2006  130,695
1  2/1/2006  138,428
2  3/1/2006  167,439
3  4/1/2006  163,272
4  5/1/2006  133,902

In [34]:
jamaica_df['y']=jamaica_df['y'].str.replace(',','')
jamaica_df['y']=jamaica_df['y'].str.replace('-','0')
jamaica_df['y']=jamaica_df['y'].astype(int)
jamaica_df['ds'] = pd.to_datetime(jamaica_df['ds'])

In [35]:
jamaica_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ds      195 non-null    datetime64[ns]
 1   y       195 non-null    int32
dtypes: datetime64[ns](1), int32(1)
memory usage: 2.4 KB

In [36]:
jamaica_df['Country'] = 'Jamaica'
jamaica_df.head()

          ds       y  Country
0 2006-01-01  130695  Jamaica
1 2006-02-01  138428  Jamaica
2 2006-03-01  167439  Jamaica
3 2006-04-01  163272  Jamaica
4 2006-05-01  133902  Jamaica

## Iceland

DataSource:

In [37]:
iceland_df = pd.read_excel(Path('Data/Iceland_Tourist_Data.xlsx'))
iceland_df.head()

          ds      y
0 2003-01-01  12697
1 2003-02-01  12948
2 2003-03-01  18537
3 2003-04-01  20465
4 2003-05-01  20373

In [38]:
iceland_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 228 entries, 0 to 227
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ds      228 non-null    datetime64[ns]
 1   y       228 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 3.7 KB

In [39]:
iceland_df['Country'] = 'Iceland'

## Consolidate Data

In [40]:
dataframes = [portugal_df,jamaica_df,iceland_df,uk_df,singapore_df]

In [41]:
lower_date = portugal_df['ds'][0]
print(lower_date)
for i in dataframes:
    date = i['ds'][0]
    print(date)
    if date > lower_date:
        lower_date = date
print(lower_date)

2000-01-31 00:00:00
2000-01-31 00:00:00
2006-01-01 00:00:00
2003-01-01 00:00:00
2012-01-01 00:00:00
2008-01-01 00:00:00
2012-01-01 00:00:00

In [42]:
data = pd.concat(dataframes,axis = 0, ignore_index = True)
#data = data[data['ds']>= lower_date]

## Database

In [43]:
#Database Connection String
database_connection_string = 'sqlite:///Resources/tourism_data.db'
#Create Engine
engine = sql.create_engine(database_connection_string)

In [44]:
data.to_sql('tourism_data',engine, index = False, if_exists='replace')